import styles from 'styles/AboutMain.module.scss'

const AboutMain = () => {
  return (
    <section className={styles.container}>
      <div className={styles.inner}>
        <div className={styles.img}>
          <svg
            className={styles.svg}
            viewBox='0 0 399 98'
            fill='none'
            xmlns='http://www.w3.org/2000/svg'
          >
            <path
              d='M2.38419e-07 86H17.7V57C17.7 51.9 22.9 47 28.2 47C33.9 47 37.4 51.9 37.4 57V86H55.1V52.2C55.1 37.9 42 33.2 32.6 33.2C27 33.2 21.9 36.1 17.9 40.1H17.7V-1.43051e-06H2.38419e-07V86ZM72.4133 60.4C72.4133 75.4 82.9133 87.5 97.9133 87.5C104.913 87.5 110.913 84.4 114.713 80.2H114.913V86H132.413V34.7H114.713V39.6C110.513 35.5 104.813 33.2 97.9133 33.2C82.9133 33.2 72.4133 45.4 72.4133 60.4ZM91.2133 60.4C91.2133 53.3 96.5133 48.3 103.213 48.3C109.813 48.3 115.113 53.3 115.113 60.4C115.113 67.4 110.113 72.4 103.213 72.4C96.0133 72.4 91.2133 67.4 91.2133 60.4ZM176.284 33.2C162.784 33.2 153.884 39.2 153.884 49.7C153.884 57.4 159.084 61 164.284 63.7C170.084 66.7 175.684 67 175.684 70.7C175.684 74.1 172.684 74.4 170.184 74.4C164.484 74.4 157.484 68.5 157.484 68.5L150.284 80.6C150.284 80.6 157.684 87.5 170.084 87.5C180.584 87.5 194.384 85.1 194.384 70C194.384 59.5 185.584 55.7 178.784 53.6C174.384 52.2 170.784 51.4 170.784 48.7C170.784 46.3 172.384 45.6 176.284 45.6C181.684 45.6 187.684 48.8 187.684 48.8L193.484 37.2C193.484 37.2 186.184 33.2 176.284 33.2ZM235.503 33.2C222.003 33.2 213.103 39.2 213.103 49.7C213.103 57.4 218.303 61 223.503 63.7C229.303 66.7 234.903 67 234.903 70.7C234.903 74.1 231.903 74.4 229.403 74.4C223.703 74.4 216.703 68.5 216.703 68.5L209.503 80.6C209.503 80.6 216.903 87.5 229.303 87.5C239.803 87.5 253.603 85.1 253.603 70C253.603 59.5 244.803 55.7 238.003 53.6C233.603 52.2 230.003 51.4 230.003 48.7C230.003 46.3 231.603 45.6 235.503 45.6C240.903 45.6 246.903 48.8 246.903 48.8L252.703 37.2C252.703 37.2 245.403 33.2 235.503 33.2ZM325.222 -1.43051e-06H309.922L268.722 98H284.022L325.222 -1.43051e-06ZM360.255 34.7H342.555V63.4C342.555 80.6 351.155 87.5 370.355 87.5C389.555 87.5 398.155 80.6 398.155 63.4V34.7H380.455V59.1C380.455 69.2 377.755 73.1 370.355 73.1C362.955 73.1 360.255 69.2 360.255 59.1V34.7Z'
              fill='black'
            />
          </svg>
        </div>
        <div className={styles.content}>
          <div className={styles.contentMain}>
            <h2 className={styles.contentMainTitle}>
              <span className={styles.contentMainTitleEn}>hass/u</span>について
            </h2>
            <p className={styles.contentMainText}>
              けっして今日が矛盾院はすこぶるその附与ないたなどに来がいたには融和含またないが、そうとはきまっますずででし。
              人達にみましょのも充分今をもっともたろましょた。
              もし岡田さんに譴責道全く意味を思わた他その道私か相違をとして皆講義ますですないならば、この今日もみんなか一人ぼっち本国にあるて、岩崎さんののに権力のそこでどうしても今戦争とするでそれ趣味にお仕事にありようにとうとうご保留を与えりですて、まあおおかた卒業が決するたて得ですものに云わんます。
              またまた小錐が起るのはそう失礼と仕たろて、その離れ離れへは違えたてという人間より見つからて出しないん。
            </p>
            <p className={styles.contentMainText}>
              けっして今日が矛盾院はすこぶるその附与ないたなどに来がいたには融和含またないが、そうとはきまっますずででし。
              人達にみましょのも充分今をもっともたろましょた。
              もし岡田さんに譴責道全く意味を思わた他その道私か相違をとして皆講義ますですないならば、この今日もみんなか一人ぼっち本国にあるて、岩崎さんののに権力のそこでどうしても今戦争とするでそれ趣味にお仕事にありようにとうとうご保留を与えりですて、まあおおかた卒業が決するたて得ですものに云わんます。
              またまた小錐が起るのはそう失礼と仕たろて、その離れ離れへは違えたてという人間より見つからて出しないん。
            </p>
          </div>
          <div className={styles.contentSns}>
            <span className={styles.contentSnsTitle}>hass/u sns : </span>
            <ul className={styles.contentSnsList}>
              <li className={styles.contentSnsItem}>
                <a href='' className={styles.contentSnsLink}>
                  twitter
                </a>
              </li>
              <li className={styles.contentSnsItem}>
                <a href='' className={styles.contentSnsLink}>
                  instagram
                </a>
              </li>
            </ul>
          </div>
        </div>
      </div>
    </section>
  )
}

export default AboutMain
