import Link from 'next/link'
import React from 'react'
import styles from 'styles/Footer.module.scss'


const Footer = () => {

    const navLinks = [
        {
            href: "/",
            text: "転職",
        },
        {
            href: "/",
            text: "副業",
        },
        {
            href: "/",
            text: "独立",
        },
        {
            href: "/",
            text: "企業PR",
        },
        {
            href: "/",
            text: "ライフスタイル",
        },
        {
            href: "/",
            text: "リセットボタン",
        },
        {
            href: "/",
            text: "コラム",
        },
        {
            href: "/",
            text: " hass/uについて",
        },
    ]

    const navSnsLinks = [
        {
            href: "/1",
            svg: "twitter",
        },
        {
            href: "/2",
            svg: 'instagram',
        },
        {
            href: "/3",
            svg: 'tiktok',
        },
    ]

    return (
        <footer className={styles.container}>
            <div className={styles.inner}>
                <div className={styles.main}>
                    <Link href="/">
                        <a className={styles.logo}>
                            <svg className={styles.logoSvg} viewBox="0 0 1156 285" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M0.400001 250H51.73V165.9C51.73 151.11 66.81 136.9 82.18 136.9C98.71 136.9 108.86 151.11 108.86 165.9V250H160.19V151.98C160.19 110.51 122.2 96.88 94.94 96.88C78.7 96.88 63.91 105.29 52.31 116.89H51.73V0.599996H0.400001V250ZM210.399 175.76C210.399 219.26 240.849 254.35 284.349 254.35C304.649 254.35 322.049 245.36 333.069 233.18H333.649V250H384.399V101.23H333.069V115.44C320.889 103.55 304.359 96.88 284.349 96.88C240.849 96.88 210.399 132.26 210.399 175.76ZM264.919 175.76C264.919 155.17 280.289 140.67 299.719 140.67C318.859 140.67 334.229 155.17 334.229 175.76C334.229 196.06 319.729 210.56 299.719 210.56C278.839 210.56 264.919 196.06 264.919 175.76ZM511.625 96.88C472.475 96.88 446.665 114.28 446.665 144.73C446.665 167.06 461.745 177.5 476.825 185.33C493.645 194.03 509.885 194.9 509.885 205.63C509.885 215.49 501.185 216.36 493.935 216.36C477.405 216.36 457.105 199.25 457.105 199.25L436.225 234.34C436.225 234.34 457.685 254.35 493.645 254.35C524.095 254.35 564.115 247.39 564.115 203.6C564.115 173.15 538.595 162.13 518.875 156.04C506.115 151.98 495.675 149.66 495.675 141.83C495.675 134.87 500.315 132.84 511.625 132.84C527.285 132.84 544.685 142.12 544.685 142.12L561.505 108.48C561.505 108.48 540.335 96.88 511.625 96.88ZM683.359 96.88C644.209 96.88 618.399 114.28 618.399 144.73C618.399 167.06 633.479 177.5 648.559 185.33C665.379 194.03 681.619 194.9 681.619 205.63C681.619 215.49 672.919 216.36 665.669 216.36C649.139 216.36 628.839 199.25 628.839 199.25L607.959 234.34C607.959 234.34 629.419 254.35 665.379 254.35C695.829 254.35 735.849 247.39 735.849 203.6C735.849 173.15 710.329 162.13 690.609 156.04C677.849 151.98 667.409 149.66 667.409 141.83C667.409 134.87 672.049 132.84 683.359 132.84C699.019 132.84 716.419 142.12 716.419 142.12L733.239 108.48C733.239 108.48 712.069 96.88 683.359 96.88ZM943.543 0.599996H899.173L779.693 284.8H824.063L943.543 0.599996ZM1045.14 101.23H993.809V184.46C993.809 234.34 1018.75 254.35 1074.43 254.35C1130.11 254.35 1155.05 234.34 1155.05 184.46V101.23H1103.72V171.99C1103.72 201.28 1095.89 212.59 1074.43 212.59C1052.97 212.59 1045.14 201.28 1045.14 171.99V101.23Z" fill="#f7f7f7"/>
                            </svg>
                        </a>
                    </Link>
                    <ul className={styles.navSnsList}>
                        {navSnsLinks.map((data) => {
                            return(
                                <li className={styles.navSnsItem}
                                    key={data.href}>
                                    <a href={data.href}
                                       className={styles.navSnsLink}>
                                        {data.svg}
                                    </a>
                                </li>
                            )
                        })}
                    </ul>
                </div>
                <nav className={styles.nav}>
                    <ul className={styles.navList}>
                        {navLinks.map((data) => {
                            return(
                                <li className={styles.navItem}
                                    key={data.text}>
                                    <Link href={data.href}>
                                        <a className={styles.navLink}>
                                            {data.text}
                                        </a>
                                    </Link>
                                </li>
                            )
                        })}
                    </ul>
                    {/* <ul className={styles.navSnsList}>
                        {navSnsLinks.map((data) => {
                            return(
                                <li className={styles.navSnsItem}
                                    key={data.href}>
                                    <a href={data.href}
                                       className={styles.navSnsLink}>
                                        {data.svg}
                                    </a>
                                </li>
                            )
                        })}
                    </ul> */}
                </nav>
            </div>
        </footer>
    );
}

export default Footer;
